t-edson/PicPas/Compativa Compiladores II/Digital_Clock_Test_PIC16F877A_XC8.c
        }
        LCD_gotoXY(lcdX, lcdY);          // Coloca el cursor en la posición de inicio de impresión del dato editado.
        if(editMenuState==SET_DIA_SEM)   // Si se está editando del día de la semana, se imprime el texto.
        {
            DS1307_DiaSemana = editDato;
            LCDPrintDiaSemana();
        }
        else LCDPrintNumero(editDato);   // El resto son variables numéricas de 2 dígitos.
        __delay_ms(TIEMPO_REPETICION);   // Espera el tiempo de autorepetición de la tecla pulsada.
    }

    if(P_SET==LOW_ST)                // Si se pulsa SET.
    {
        editMenuState++;
        while(P_SET==LOW_ST) __delay_ms(TIEMPO_ANTIREBOTE);  // Espera antirebote mecánico del pulsador.
        if(editDato>limSup) editDato=limSup;  // Evita posible bug al modificar el año o el mes, si
                                              // no se modifica el día y en ese año o mes ya no es válido.
    }

    if(editMenuState==SET_DIA_SEM) lcdX++;  // Si se está editando el día de la semana, se desplaza el cursor
                                            // una posición más, ya que el texto ocupa 3 posiciones, en lugar
                                            // de dos como el resto de variables.
    LCD_gotoXY(++lcdX, lcdY);          // Coloca el cursor en la parte izquierda de la variable editada.
    LCD_command(LCD_CURSOR_UNDELINE);  // Cursor On
    return editDato;
}

/****************************************************************************
  - Función: timeRead
  - Descripción: Set fecha y hora mediante pulsadores y cursor en display LCD.
    Programado según la lógica de una "máquina de estado". La variable global
    editMenuState indica la posición del cursor dentro del bucle de fijación de fecha y
    hora.
  - Entrada: Ninguna.
  - Salida: Ninguna.
*****************************************************************************/
void timeSet(void)
{
    LCD_gotoXY(7,1);           // Goto posición de Segundos en display.
    LCDPrintNumero(0);         // 00 en posición de Segundos del display.
    LCD_command(LCD_CURSOR_UNDELINE);       // Cursor On
    while(editMenuState<SALIR_SET_TIME)
    {
        while(editMenuState==SET_ANO)
            DS1307_Ano = cicloTimeSet(0,99,7,0,DS1307_Ano);               // Set año.
        while(editMenuState==SET_MES)
            DS1307_Mes = cicloTimeSet(1,12,4,0,DS1307_Mes);               // Set mes.
        while(editMenuState==SET_DIA)
            DS1307_Dia= cicloTimeSet(1,diasDelMes(),1,0,DS1307_Dia);      // Set día.
        while(editMenuState==SET_HORA)
            DS1307_Hora = cicloTimeSet(0,23,1,1,DS1307_Hora);             // Set hora.
        while(editMenuState==SET_MINUTO)
            DS1307_Minuto = cicloTimeSet(0,59,4,1,DS1307_Minuto);         // Set minutos.
        while(editMenuState==SET_DIA_SEM)
            DS1307_DiaSemana = cicloTimeSet(1,7,12,0,DS1307_DiaSemana);   // Set día de la semana.
    }
    LCD_command(LCD_CURSOR_OFF);            // Cursor Off
}

/****************************************************************************
  - Función: Setup
  - Descripción: Inicializa Microcontrolador y Hardware externo conectado.
  - Entrada: Ninguna.
  - Salida: Ninguna.
*****************************************************************************/
void setup(void)
{
    CMCON  = 0x07;          // Deshabilita comparadores.
    ADCON1 = 0x06;          // Todos los pines configurados como digitales.
    ADCON0 = 0x00;          // Desactiva conversor A/D.
    GIE    = false;         // Todas las interrupciones desactivadas.

    P_INC_DIR = INPUT_PIN;  // Configura Pulsadores como Entradas.
    P_DEC_DIR = INPUT_PIN;
    P_SET_DIR = INPUT_PIN;
    SOUT_DIR  = INPUT_PIN;

    I2C_start();                 // Inicia comunicación I2C
    I2C_writeByte(0xD0);         // Dirección I2C del DS1307.
    I2C_writeByte(0x07);         // Escribe en la dirección 07h.
    I2C_writeByte(DS1307_CONF);  // Configura 1 Hz en salida SOUT del DS1307
    I2C_stop();
    
    LCD_init();                  // Inicializa display LCD.
}

/****************************************************************************
  - Función: main
  - Descripción: Programa Principal.
  - Entrada: Ninguna.
  - Salida: Ninguna.
*****************************************************************************/
void main(void)
{
    setup();

    while(true)
    {
        if(P_SET==LOW_ST)   // Comprueba si se ha pulsado SET
        {
            editMenuState = SET_ANO;
            // Espera fin pulsación y antirebote mecánico.
            while(P_SET==LOW_ST) __delay_ms(TIEMPO_ANTIREBOTE);
            timeSet();            // Ajuste de reloj.
            DS1307_timeWrite();   // Envía datos editados.
        }

        DS1307_timeRead();  // Lee la fecha y hora en el DS1307.
        timeShow();         // Actualiza display LCD con fecha y hora.

        // Espera 1 segundo usando salida SOUT del DS1307 (1 Hz)
        while(SOUT);        // Espera durante pulso alto.
        while(!SOUT);       // Espera durante pulso bajo.
    }
}
